src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="98375782-7122-4eef-88e9-13504abb6f3d">
  <name>СписаниеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6c3f5130-070f-4922-8828-aa5f705dd12d">
    <name>ИнвентаризацияТоваровНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f10b402-ea5e-4007-a708-f4dbb1bd4dba">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="20eefe7e-c45a-4c39-8963-bd3a5c028835">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55ccc6a2-4228-45bc-9a73-a76ce0908ff0">
    <name>ПодразделениеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2619cbea-9f3f-4850-a223-d5e971abf766">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="03ce342f-765c-4071-b6f4-e62b95fd1311">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1ffed464-ff21-4110-9e6c-5b7733fede53">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1c31223b-542e-4674-aca6-bb6e60869ff1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9b7c1dab-36a4-4548-8780-c17231c64f95">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2617b3df-3611-41a6-a84f-5a12ba9e46f5">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb2a6d05-98b2-43d4-95a9-a339e7d5907d">
      <name>Себестоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93827d4d-4945-4bb5-a5ac-f3a851a08410">
      <name>СчетУчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b0065be6-1204-4ac9-9dcd-e4414e09a9b4">
      <name>КоличествоМест</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2eefb24a-455a-43f8-80bd-d4946f22677c">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3cfca87a-1b5d-434f-b7e7-4ad671c998ce">
    <name>ВозвратнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3f19208d-64df-402f-b87c-114297434ec8">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="944170fe-0171-4826-858f-c1418ccb12c1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ОтражениеВУСН/ОтражениеВУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d42b1ee-230e-4d56-9641-c679f5443bed">
  <name>ОтражениеВУСН</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="085aa59e-17d0-4096-aae1-06fe22efd200">
    <name>НеПринимаются</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="991ef081-60e2-4f0d-9ec6-d7c8297d76e2">
    <name>Принимаются</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Documents/ОтчетОРозничныхПродажах/ОтчетОРозничныхПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b9bdcee6-45bd-4f47-851c-6f90e0d0dd13">
  <name>ОтчетОРозничныхПродажах</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="902c1b91-5eb3-4811-a71a-6a5765eb6c62">
    <name>ИнвентаризацияТоваровНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73c69aed-76d9-41af-8319-bef254ef5885">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="3c4b45fd-65c3-46a3-b288-6b114e3b7b60">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="212b9a17-6082-475c-83b8-c5479822f0ba">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d25c4871-ba41-4553-9e72-3a4a235e61c7">
      <name>СчетУчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9ca4936-5010-4d53-a79c-b08f6ff7c07c">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ae30beb9-b16c-4895-994a-33bc3fc816ea">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИнвентаризацияТоваровНаСкладе/ИнвентаризацияТоваровНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="57fa4881-8ea1-451d-92c8-7dd84266404a">
  <name>ИнвентаризацияТоваровНаСкладе</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="62c75192-6444-4eeb-992c-bbbc3f4c1f91">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0b0c1280-f9e7-4b79-ae80-e7566e2262ac">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="cb4154de-c22f-4707-b49d-2cf20b61df46">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6706d540-644d-4e64-b78e-3a3d806a9ae3">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="541b6451-9aa0-4d6a-aece-a1bf05a29481">
      <name>КоличествоУчет</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="002946a1-fbe5-476c-9e97-da85566f4525">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6bf6677f-d1be-4351-bdee-1ccd92235b6a">
      <name>СчетУчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4836de1f-9d1b-404a-a089-4f581960a7da">
      <name>ЦенаВРознице</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СписаниеТоваров/ObjectModule.bsl
&Вместо("ЗаполнитьТоварыПоИнвентаризацииТоваров")
Процедура Базар_ЗаполнитьТоварыПоИнвентаризацииТоваров(ДокументОснование) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокументСписания", Ссылка);
	Запрос.УстановитьПараметр("ДокументОснованиеСсылка", ДокументОснование);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПредыдущиеСписания.Номенклатура КАК Номенклатура,
	               |	ПредыдущиеСписания.СчетУчета КАК СчетУчета,
	               |	ПредыдущиеСписания.Склад КАК Склад,
	               |	ПредыдущиеСписания.Количество КАК Количество,
	               |	ПредыдущиеСписания.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТ_ПредыдущиеСписания
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ДокСписание.Номенклатура КАК Номенклатура,
	               |		ДокСписание.СчетУчета КАК СчетУчета,
	               |		ДокСписание.Ссылка.Склад КАК Склад,
	               |		ДокСписание.Количество КАК Количество,
	               |		ДокСписание.Цена КАК Цена
	               |	ИЗ
	               |		Документ.СписаниеТоваров.Товары КАК ДокСписание
	               |	ГДЕ
	               |		ДокСписание.Ссылка <> &ТекущийДокументСписания
	               |		И ДокСписание.Ссылка.Проведен
	               |		И ДокСписание.Ссылка.ИнвентаризацияТоваровНаСкладе = &ДокументОснованиеСсылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ДокОтчетККМ.Номенклатура,
	               |		ДокОтчетККМ.СчетУчета,
	               |		ДокОтчетККМ.Ссылка.Склад,
	               |		ДокОтчетККМ.Количество,
	               |		ДокОтчетККМ.Цена
	               |	ИЗ
	               |		Документ.ОтчетОРозничныхПродажах.Товары КАК ДокОтчетККМ
	               |	ГДЕ
	               |		ДокОтчетККМ.Ссылка.Проведен
	               |		И ДокОтчетККМ.Ссылка.ИнвентаризацияТоваровНаСкладе = &ДокументОснованиеСсылка) КАК ПредыдущиеСписания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Док.Номенклатура КАК Номенклатура,
	               |	Док.СчетУчета КАК СчетУчета,
	               |	Док.Ссылка.Склад КАК Склад,
	               |	МАКСИМУМ(Док.КоличествоУчет - Док.Количество) КАК КоличествоОтклонение,
	               |	ВЫБОР
	               |		КОГДА СУММА(ВТ_ПредыдущиеСписания.Количество) ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ СУММА(ВТ_ПредыдущиеСписания.Количество)
	               |	КОНЕЦ КАК КоличествоСписанное,
	               |	Док.ЦенаВРознице КАК ЦенаВРознице,
	               |	Док.Цена КАК Цена,
	               |	Док.Номенклатура.НоменклатурнаяГруппа КАК НоменклатураНоменклатурнаяГруппа
	               |ИЗ
	               |	Документ.ИнвентаризацияТоваровНаСкладе.Товары КАК Док
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредыдущиеСписания КАК ВТ_ПредыдущиеСписания
	               |		ПО Док.Номенклатура = ВТ_ПредыдущиеСписания.Номенклатура
	               |			И Док.СчетУчета = ВТ_ПредыдущиеСписания.СчетУчета
	               |			И Док.Ссылка.Склад = ВТ_ПредыдущиеСписания.Склад
	               |ГДЕ
	               |	Док.Ссылка = &ДокументОснованиеСсылка
	               |	И Док.КоличествоУчет - Док.Количество > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Док.Ссылка.Склад,
	               |	Док.Номенклатура,
	               |	Док.СчетУчета,
	               |	Док.ЦенаВРознице,
	               |	Док.Цена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НоменклатураНоменклатурнаяГруппа,
	               |	Номенклатура";
	
	Склад		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Склад"); // |		И #УсловиеПоЦене#
	ТипСклада	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада");
	
	Если ТипСклада = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеПоЦене#", "Док.Цена = ВТ_ПредыдущиеСписания.Цена");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеПоЦене#", "ИСТИНА");
	КонецЕсли;
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ЭтотОбъект);
	
	СоответствиеСведенийОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(
		ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаТоваров, "Номенклатура", Истина), ДанныеОбъекта, Ложь, Ложь);
		
	СтрокиДляЗаполненияСчетовУчета = Новый Массив;
		
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		КоличествоСписать = СтрокаТовара.КоличествоОтклонение - СтрокаТовара.КоличествоСписанное;
		
		Если КоличествоСписать <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Товары.Добавить();
		СтрокиДляЗаполненияСчетовУчета.Добавить(СтрокаТабличнойЧасти);
		
		СтрокаТабличнойЧасти.Номенклатура	= СтрокаТовара.Номенклатура;
		СтрокаТабличнойЧасти.Количество		= КоличествоСписать;
		СтрокаТабличнойЧасти.СчетУчета		= СтрокаТовара.СчетУчета;
		СтрокаТабличнойЧасти.ОтражениеВУСН	= Перечисления.ОтражениеВУСН.НеПринимаются;
		
		Если ТипСклада = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
			СтрокаТабличнойЧасти.Цена = СтрокаТовара.ЦенаВРознице;
		Иначе
			СтрокаТабличнойЧасти.Цена = СтрокаТовара.Цена;
		КонецЕсли;
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
		
		СведенияОНоменклатуре = СоответствиеСведенийОНоменклатуре.Получить(СтрокаТовара.Номенклатура);
		Если СведенияОНоменклатуре = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ЕдиницаИзмерения		= СведенияОНоменклатуре.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент			= СведенияОНоменклатуре.Коэффициент;
		СтрокаТабличнойЧасти.НомерГТД				= СведенияОНоменклатуре.НомерГТД;
		СтрокаТабличнойЧасти.СтранаПроисхождения	= СведенияОНоменклатуре.СтранаПроисхождения;
		
	КонецЦикла;
	
	СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиДляЗаполненияСчетовУчета, "Товары", ЭтотОбъект, Документы.СписаниеТоваров);
	
	Если Товары.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'В документе ""%1 № %2"" отсутствуют товары фактическое количество которых превышает учетное.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			ДокументОснование.Метаданные().Представление(), ДокументОснование.Номер);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИнвентаризацияТоваровНаСкладе", "Объект");
	КонецЕсли;

КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Базар_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ИнвентаризацияТоваровНаСкладе) тогда
		ПроверяемыеРеквизиты.Добавить("Товары.Цена");
		ПроверяемыеРеквизиты.Добавить("Товары.Сумма");
	КонецЕсли;
	
КонецПроцедуры
